EDT/УТ/src/Documents/ЗагрузкаСТСД/ЗагрузкаСТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗагрузкаСТСД</name>
  <registerRecords>InformationRegister.ФиксацияВеса</registerRecords>
  <registerRecords>InformationRegister.ФиксацияОбъема</registerRecords>
  <registerRecords>InformationRegister.экУчетПроизводственныхОпераций</registerRecords>
  <registerRecords>InformationRegister.УчетВыходаНаРаботуСотрудниковКомпании</registerRecords>
  <registerRecords>InformationRegister.СтатусыСкладскогоУчета</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗагрузкиТСД</name>
    <type>
      <types>EnumRef.ТипыЗагрузкиТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>Ид_Документа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ид_Терминала</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Завершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Изменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтрокФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерверТСД</name>
    <type>
      <types>CatalogRef.СерверыWiFiТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусыВыгруженыВАдминку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныеВесы</name>
    <type>
      <types>CatalogRef.ЭлектронныеВесы</types>
    </type>
  </attributes>
  <attributes>
    <name>СчитыватьВес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерминалПриема</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерминалДоставки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПриходПринципала</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛинейкаИзмеренияГабаритов</name>
    <type>
      <types>CatalogRef.ЛинейкиИзмеренияГабаритов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВспомогательныйРежимТСД</name>
    <type>
      <types>EnumRef.ТипыЗагрузкиТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПалеты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТСД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Штрихкоды</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.ЗаборТовара</types>
        <types>DocumentRef.Фрахт</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>РезультатДоставки</name>
      <type>
        <types>CatalogRef.новаРезультатМестнойДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаНевыполнения</name>
      <type>
        <types>CatalogRef.ПричиныНеВыполненияДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗаказа</name>
      <type>
        <types>EnumRef.ТипыЗаказов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнешнийНомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакСтабильностиВесов</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВремя</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>НеизвестныйТовар</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СканированныйОбъем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Флаг</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>22</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МестоЗаказа</name>
      <type>
        <types>CatalogRef.МестаПоЗаказам</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерПалеты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсключитьЧастичноПринятыйЗаказИзРейса</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИзмерениеГабаритов</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодГабарита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Измерение</name>
      <type>
        <types>EnumRef.Измерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеИзмерения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтменаИзмерения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>БэйджиСотрудников</name>
    <attributes>
      <name>БейджСотрудника</name>
      <type>
        <types>CatalogRef.БэйджиСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.новаЭкспедиторы</types>
        <types>CatalogRef.новаВодители</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипУчастникаЭкипажа</name>
      <type>
        <types>EnumRef.УчастникЭкипажа</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СервисныеШК</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Режим</name>
      <type>
        <types>EnumRef.ТипыЗагрузкиТСД</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаказыРейса</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИгнорируемыеШтрихкоды</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерПалеты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяСканирования</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/новаЗаданияРейсов/новаЗаданияРейсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>новаЗаданияРейсов</name>
  <resources>
    <name>Вид</name>
    <type>
      <types>EnumRef.новаВидыЗаданийРейсаМестнойДоставки</types>
    </type>
  </resources>
  <resources>
    <name>Доставка</name>
    <type>
      <types>BusinessProcessRef.новаМестнаяДоставка</types>
    </type>
  </resources>
  <resources>
    <name>ЗаданиеВыполнено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗаданиеВыполненоВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Рейс</name>
    <type>
      <types>BusinessProcessRef.новаРейсМестнойДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодТочки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЗадания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>МаршрутСопровождения</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/СостоянияЗаказов/СостоянияЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияЗаказов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>РезультатДоставки</name>
    <type>
      <types>CatalogRef.новаРезультатМестнойДоставки</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаНеВыполнения</name>
    <type>
      <types>CatalogRef.ПричиныНеВыполненияДоставки</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаОтказа</name>
    <type>
      <types>CatalogRef.ПричиныОтказаПереноса</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПереноса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Экспедитор_КУдалению</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
    </type>
  </resources>
  <resources>
    <name>Водитель_КУдалению</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </resources>
  <resources>
    <name>СторонаПретензий</name>
    <type>
      <types>EnumRef.СторонаПретензий</types>
    </type>
  </resources>
  <resources>
    <name>Инициатор</name>
    <type>
      <types>EnumRef.ИнициаторыСостояния</types>
    </type>
  </resources>
  <resources>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </resources>
  <resources>
    <name>ДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Доставка</name>
    <type>
      <types>BusinessProcessRef.новаМестнаяДоставка</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Catalogs/СхемыШтрихкодирования/СхемыШтрихкодирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СхемыШтрихкодирования</name>
  <predefined>
    <items>
      <name>Enter</name>
      <description>Enter</description>
    </items>
    <items>
      <name>MamasPapas</name>
      <description>Mamas&amp;Papas</description>
    </items>
    <items>
      <name>MediaMarkt</name>
      <description>MediaMarkt</description>
    </items>
    <items>
      <name>Автофидес</name>
      <description>Автофидес</description>
    </items>
    <items>
      <name>ДетскийМир</name>
      <description>Детский мир</description>
    </items>
    <items>
      <name>Кораблик</name>
      <description>Кораблик</description>
    </items>
    <items>
      <name>ПоШтрихкоду37</name>
      <description>По штрихкоду 37</description>
    </items>
  </predefined>
  <tabularSections>
    <name>Контрагенты</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/УТ/src/Documents/ЗагрузкаСТСД/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//ТолькоПросмотр = Истина;
	Если ПараметрыСеанса.ЭтоТестоваяСреда Тогда
		Элементы.Ид_Документа.Доступность = Истина;
	КонецеСли;	
КонецПроцедуры

&НаКлиенте
Процедура ПривязатьЗаказы(Команда)
	
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	СхемыШтрихкодированияКонтрагенты.Контрагент,
	            |	СхемыШтрихкодированияКонтрагенты.Ссылка.Ссылка КАК Схема
	            |ИЗ
	            |	Справочник.СхемыШтрихкодирования.Контрагенты КАК СхемыШтрихкодированияКонтрагенты
	            |ГДЕ
	            |	СхемыШтрихкодированияКонтрагенты.Ссылка.ПометкаУдаления = ЛОЖЬ
	            |
	            |УПОРЯДОЧИТЬ ПО
	            |	СхемыШтрихкодированияКонтрагенты.Контрагент.Приоритет";
				
	Список = Зап.Выполнить().Выгрузить();			
				
	Если Список.Количество() = 0 Тогда
		Возврат;
	Иначе
		Нач = Список[0];
	КонецеСли;	
	
	
	ВыбЗн = Список.ВыбратьСтроку("Укажите магазин...", Нач);
	
	Если ВыбЗн <> Неопределено Тогда
		Если ВыбЗн.Схема = Справочники.СхемыШтрихкодирования.Enter Тогда
			Для Каждого Тек Из Объект.Штрихкоды ЦИкл
				Если Тек.Заказ.Пустая() Тогда
					Штр = Лев(СокрЛП(Тек.Штрихкод), 4) + "-" + Прав(СокрЛП(Тек.Штрихкод), СтрДлина(СокрЛП(Тек.Штрихкод)) - 4);
					Най = Документы.РеализацияТоваровУслуг.НайтиПоРеквизиту("НомерВнешнегоЗаказа", Штр);
					Тек.Заказ = Най.Ссылка;
					Если Не Тек.Заказ.Пустая() Тогда
						Тек.контрагент = Тек.Заказ.ВладелецТовара;
					КонецеСли;	
				КонецеСли;
			КонецЦикла;	
		ИначеЕсли ВыбЗн.Схема = Справочники.СхемыШтрихкодирования.MediaMarkt Тогда
			Для Каждого Тек Из Объект.Штрихкоды ЦИкл
				Если Тек.Заказ.Пустая() Тогда
					Штр = СокрЛП(Тек.Штрихкод);
					Зап = Новый Запрос;
					Зап.Текст = "ВЫБРАТЬ
					            |	РеализацияТоваровУслуг.Ссылка КАК Док
					            |ИЗ
					            |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
					            |ГДЕ
					            |	РеализацияТоваровУслуг.НомерВнешнегоЗаказа Подобно (&НомерВнешнегоЗаказа)
					            |	И РеализацияТоваровУслуг.ВладелецТовара = &ВладелецТовара";
								
					Зап.УстановитьПараметр("НомерВнешнегоЗаказа", "%" + Штр + "%");
					Зап.УстановитьПараметр("ВладелецТовара", ВыбЗн.Контрагент);
					
					Рез = Зап.Выполнить().Выгрузить();
					Если Рез.Количество() <> 0 Тогда
						Тек.Заказ = Рез[0].Док;
						Тек.контрагент = ВыбЗн.Контрагент;
					КонецеСли;
				КонецеСли;
			КонецЦикла;	
		ИначеЕсли ВыбЗн.Схема = Справочники.СхемыШтрихкодирования.Кораблик Тогда
			Для Каждого Тек Из Объект.Штрихкоды ЦИкл
				Если Тек.Заказ.Пустая() Тогда
					Штр = Лев(СокрЛП(Тек.Штрихкод), 6);
					Зап = Новый Запрос;
					Зап.Текст = "ВЫБРАТЬ
					            |	РеализацияТоваровУслуг.Ссылка КАК Док
					            |ИЗ
					            |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
					            |ГДЕ
					            |	РеализацияТоваровУслуг.НомерВнешнегоЗаказа Подобно (&НомерВнешнегоЗаказа)
					            |	И РеализацияТоваровУслуг.ВладелецТовара = &ВладелецТовара";
								
					Зап.УстановитьПараметр("НомерВнешнегоЗаказа", "%" + Штр + "%");
					Зап.УстановитьПараметр("ВладелецТовара", ВыбЗн.Контрагент);
					
					Рез = Зап.Выполнить().Выгрузить();
					Если Рез.Количество() <> 0 Тогда
						Тек.Заказ = Рез[0].Док;
						Тек.контрагент = ВыбЗн.Контрагент;
					КонецеСли;
				КонецеСли;
			КонецЦикла;	
		ИначеЕсли ВыбЗн.Схема = Справочники.СхемыШтрихкодирования.Автофидес Тогда
			Для Каждого Тек Из Объект.Штрихкоды ЦИкл
				Если Тек.Заказ.Пустая() Тогда
					
					Штр = Лев(СокрЛП(Тек.Штрихкод), 9);
					Если Не ОбщегоНазначения.ТолькоЦифрыВСтроке(Штр) Тогда
						Продолжить;
					КонецеСли;
					
					Штр = Формат(Число(Штр), "ЧГ=");
					Зап = Новый Запрос;
					Зап.Текст = "ВЫБРАТЬ
					            |	РеализацияТоваровУслуг.Ссылка КАК Док
					            |ИЗ
					            |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
					            |ГДЕ
					            |	(РеализацияТоваровУслуг.НомерВнешнегоЗаказа ПОДОБНО &НомерВнешнегоЗаказа
					            |				И РеализацияТоваровУслуг.ВладелецТовара = &ВладелецТовара
					            |			ИЛИ РеализацияТоваровУслуг.Номер ПОДОБНО &Номер
					            |				И РеализацияТоваровУслуг.ВладелецТовара = &ВладелецТовара)";
								
					Зап.УстановитьПараметр("НомерВнешнегоЗаказа", "%" + Штр + "%");
					Зап.УстановитьПараметр("Номер", "%" + Штр + "%");
					Зап.УстановитьПараметр("ВладелецТовара", ВыбЗн.Контрагент);
					
					Рез = Зап.Выполнить().Выгрузить();
					Если Рез.Количество() <> 0 Тогда
						Тек.Заказ = Рез[0].Док;
						Тек.контрагент = ВыбЗн.Контрагент;
					КонецеСли;
				КонецеСли;
			КонецЦикла;	
		ИначеЕсли ВыбЗн.Схема = Справочники.СхемыШтрихкодирования.ДетскийМир Тогда
			Для Каждого Тек Из Объект.Штрихкоды ЦИкл
				Если Тек.Заказ.Пустая() Тогда
					
					Штр = СокрЛП(Тек.Штрихкод);
					Штр = Лев(Штр, СтрДлина(Штр) - 2);
					
					
					// наш номер
					Штр2 = Лев(СокрЛП(Тек.Штрихкод), 9);
					Если Не ОбщегоНазначения.ТолькоЦифрыВСтроке(Штр2) Тогда
						Штр2 = Штр;
					Иначе
						Штр2 = Формат(Число(Штр), "ЧГ=");
					КонецеСли;
					
					
					
					Зап = Новый Запрос;
					Зап.Текст = "ВЫБРАТЬ
					            |	РеализацияТоваровУслуг.Ссылка КАК Док
					            |ИЗ
					            |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
					            |ГДЕ
					            |	(РеализацияТоваровУслуг.НомерВнешнегоЗаказа ПОДОБНО &НомерВнешнегоЗаказа
					            |				И РеализацияТоваровУслуг.ВладелецТовара = &ВладелецТовара
					            |			ИЛИ РеализацияТоваровУслуг.Номер ПОДОБНО &Номер
					            |				И РеализацияТоваровУслуг.ВладелецТовара = &ВладелецТовара)";
								
					Зап.УстановитьПараметр("НомерВнешнегоЗаказа", "%" + Штр + "%");
					Зап.УстановитьПараметр("Номер", "%" + Штр2 + "%");
					Зап.УстановитьПараметр("ВладелецТовара", ВыбЗн.Контрагент);
					
					Рез = Зап.Выполнить().Выгрузить();
					Если Рез.Количество() <> 0 Тогда
						Тек.Заказ = Рез[0].Док;
						Тек.контрагент = ВыбЗн.Контрагент;
					КонецеСли;
				КонецеСли;
			КонецЦикла;	
		ИначеЕсли ВыбЗн.Схема = Справочники.СхемыШтрихкодирования.MamasPapas Тогда
			Для Каждого Тек Из Объект.Штрихкоды ЦИкл
				Если Тек.Заказ.Пустая() Тогда
					
					Штр = СокрЛП(Тек.Штрихкод);
					Штр = Лев(Штр, 5);
					Штр_2 = Лев(Штр, 7);
					
					
					// наш номер
					Штр2 = Лев(СокрЛП(Тек.Штрихкод), 9);
					Если Не ОбщегоНазначения.ТолькоЦифрыВСтроке(Штр2) Тогда
						Штр2 = Штр;
					Иначе
						Штр2 = Формат(Число(Штр), "ЧГ=");
					КонецеСли;
					
					
					
					Зап = Новый Запрос;
					Зап.Текст = "ВЫБРАТЬ
					            |	РеализацияТоваровУслуг.Ссылка КАК Док
					            |ИЗ
					            |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
					            |ГДЕ
					            |	(РеализацияТоваровУслуг.НомерВнешнегоЗаказа ПОДОБНО &НомерВнешнегоЗаказа
					            |				И РеализацияТоваровУслуг.ВладелецТовара = &ВладелецТовара
					            |			ИЛИ РеализацияТоваровУслуг.Номер ПОДОБНО &Номер
					            |				И РеализацияТоваровУслуг.ВладелецТовара = &ВладелецТовара
					            |			ИЛИ РеализацияТоваровУслуг.НомерВнешнегоЗаказа ПОДОБНО &НомерВнешнегоЗаказа_2
					            |				И РеализацияТоваровУслуг.ВладелецТовара = &ВладелецТовара)";
								
					Зап.УстановитьПараметр("НомерВнешнегоЗаказа", "%" + Штр + "%");
					Зап.УстановитьПараметр("НомерВнешнегоЗаказа_2", "%" + Штр_2 + "%");
					Зап.УстановитьПараметр("Номер", "%" + Штр2 + "%");
					Зап.УстановитьПараметр("ВладелецТовара", ВыбЗн.Контрагент);
					
					Рез = Зап.Выполнить().Выгрузить();
					Если Рез.Количество() <> 0 Тогда
						Тек.Заказ = Рез[0].Док;
						Тек.контрагент = ВыбЗн.Контрагент;
					КонецеСли;
				КонецеСли;
			КонецЦикла;				
		ИначеЕсли ВыбЗн.Схема = Справочники.СхемыШтрихкодирования.ПоШтрихкоду37 Тогда
			Для Каждого Тек Из Объект.Штрихкоды ЦИкл
				Если Тек.Заказ.Пустая() Тогда
					Штр = Сред(Тек.Штрихкод, 7, 6);
					Зап = Новый Запрос;
					Зап.Текст = "ВЫБРАТЬ
					            |	РеализацияТоваровУслуг.Ссылка КАК Док
					            |ИЗ
					            |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
					            |ГДЕ
					            |	РеализацияТоваровУслуг.Номер Подобно (&Номер)";
								
					Зап.УстановитьПараметр("Номер", "%" + Штр + "%");
					
					Рез = Зап.Выполнить().Выгрузить();
					Если Рез.Количество() <> 0 Тогда
						Тек.Заказ = Рез[0].Док;
						Тек.контрагент = Тек.Заказ.ВладелецТовара;
					КонецеСли;
				КонецеСли;
			КонецЦикла;	
			
		КонецеСли;
	КонецеСли;
КонецПроцедуры

&НаСервере
Функция ПечатьСпискаЗаказовКПереносу(ТекДата)
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	РеализацияТоваровУслуг.Ссылка КАК Заказ
	            |ПОМЕСТИТЬ ВТЗаказыПоедут
	            |ИЗ
	            |	РегистрСведений.новаЗаданияРейсов КАК новаЗаданияРейсов
	            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	            |		ПО новаЗаданияРейсов.Доставка.Номер = РеализацияТоваровУслуг.Номер
	            |ГДЕ
	            |	новаЗаданияРейсов.Рейс.ДатаНачала >= &ДатаНачала2
	            |
	            |СГРУППИРОВАТЬ ПО
	            |	РеализацияТоваровУслуг.Ссылка
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	ЗагрузкаСТСДШтрихкоды.Заказ.Ссылка КАК Заказ
	            |ПОМЕСТИТЬ ВТПереносы
	            |ИЗ
	            |	Документ.ЗагрузкаСТСД.Штрихкоды КАК ЗагрузкаСТСДШтрихкоды
	            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказов.СрезПоследних(, ) КАК СостоянияЗаказовСрезПоследних
	            |		ПО (ВЫРАЗИТЬ(ЗагрузкаСТСДШтрихкоды.Заказ КАК Документ.РеализацияТоваровУслуг).Номер = СостоянияЗаказовСрезПоследних.Доставка.Номер)
	            |ГДЕ
	            |	СостоянияЗаказовСрезПоследних.ПричинаНеВыполнения В (ЗНАЧЕНИЕ(справочник.причиныневыполнениядоставки.ОтказКлиентаБезЗаезда), ЗНАЧЕНИЕ(справочник.причиныневыполнениядоставки.ОтказКлиентаСЗаездом), ЗНАЧЕНИЕ(справочник.причиныневыполнениядоставки.НетНаСкладе), ЗНАЧЕНИЕ(справочник.причиныневыполнениядоставки.НеДоставлен))
	            |	И ЗагрузкаСТСДШтрихкоды.Ссылка.Ссылка = &Док
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	ЕСТЬNULL(ВТЗаказыПоедут.Заказ, ИСТИНА) КАК Отсутствует,
	            |	ЗагрузкаСТСДШтрихкоды.Заказ.Номер КАК Номер,
	            |	ЗагрузкаСТСДШтрихкоды.Штрихкод,
	            |	ЗагрузкаСТСДШтрихкоды.Заказ,
	            |	ЕСТЬNULL(ВТПереносы.Заказ, ИСТИНА) КАК НеПеренесен
	            |ПОМЕСТИТЬ ВТЗаказы
	            |ИЗ
	            |	Документ.ЗагрузкаСТСД.Штрихкоды КАК ЗагрузкаСТСДШтрихкоды
	            |		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаказыПоедут КАК ВТЗаказыПоедут
	            |		ПО (ВЫРАЗИТЬ(ЗагрузкаСТСДШтрихкоды.Заказ КАК Документ.РеализацияТоваровУслуг).Ссылка = ВТЗаказыПоедут.Заказ.Ссылка)
	            |		ЛЕВОЕ СОЕДИНЕНИЕ ВТПереносы КАК ВТПереносы
	            |		ПО (ВЫРАЗИТЬ(ЗагрузкаСТСДШтрихкоды.Заказ КАК Документ.РеализацияТоваровУслуг).Ссылка = ВТПереносы.Заказ.Ссылка)
	            |ГДЕ
	            |	ВЫРАЗИТЬ(ЗагрузкаСТСДШтрихкоды.Заказ КАК Документ.РеализацияТоваровУслуг).Дата < &ДатаНачала
	            |	И ЗагрузкаСТСДШтрихкоды.Ссылка.Ссылка = &Док
	            |	И ВЫРАЗИТЬ(ЗагрузкаСТСДШтрихкоды.Заказ КАК Документ.РеализацияТоваровУслуг).СтатусИнтернетМагазина = 2
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	ВТЗаказы.Номер КАК НомерЗаказа,
	            |	ВТЗаказы.Штрихкод КАК Штрихкод,
	            |	ВТЗаказы.Заказ
	            |ПОМЕСТИТЬ ВТЗаказыКОтбору
	            |ИЗ
	            |	ВТЗаказы КАК ВТЗаказы
	            |ГДЕ
	            |	ВТЗаказы.Отсутствует = ИСТИНА
	            |	И ВТЗаказы.НеПеренесен = ИСТИНА
	            |
	            |СГРУППИРОВАТЬ ПО
	            |	ВТЗаказы.Номер,
	            |	ВТЗаказы.Штрихкод,
	            |	ВТЗаказы.Заказ
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	ЕСТЬNULL(новаМестнаяДоставка.Ссылка, ИСТИНА) КАК Самовывоз,
	            |	ВТЗаказыКОтбору.НомерЗаказа,
	            |	ВТЗаказыКОтбору.Заказ
	            |ПОМЕСТИТЬ ВТСамовывоз
	            |ИЗ
	            |	ВТЗаказыКОтбору КАК ВТЗаказыКОтбору
	            |		ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.новаМестнаяДоставка КАК новаМестнаяДоставка
	            |		ПО ВТЗаказыКОтбору.НомерЗаказа = новаМестнаяДоставка.Номер
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	""Самовывоз"" КАК ТипЗаказа,
	            |	ВТСамовывоз.НомерЗаказа,
	            |	ВТСамовывоз.Заказ,
	            |	0 КАК Широта,
	            |	0 КАК Долгота
	            |ПОМЕСТИТЬ ВТТаблицаСГруппировкой
	            |ИЗ
	            |	ВТСамовывоз КАК ВТСамовывоз
	            |ГДЕ
	            |	ВТСамовывоз.Самовывоз = ИСТИНА
	            |
	            |ОБЪЕДИНИТЬ ВСЕ
	            |
	            |ВЫБРАТЬ
	            |	""Москва"",
	            |	ВТЗаказыКОтбору.НомерЗаказа,
	            |	ВТЗаказыКОтбору.Заказ,
	            |	новаМестнаяДоставка.ТочкаПрибытия.Адрес.Широта,
	            |	новаМестнаяДоставка.ТочкаПрибытия.Адрес.Долгота
	            |ИЗ
	            |	БизнесПроцесс.новаМестнаяДоставка КАК новаМестнаяДоставка
	            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗаказыКОтбору КАК ВТЗаказыКОтбору
	            |		ПО новаМестнаяДоставка.Номер = ВТЗаказыКОтбору.НомерЗаказа
	            |ГДЕ
	            |	новаМестнаяДоставка.ТочкаПрибытия.Москва = ИСТИНА
	            |
	            |ОБЪЕДИНИТЬ ВСЕ
	            |
	            |ВЫБРАТЬ
	            |	""За МКАД"",
	            |	ВТЗаказыКОтбору.НомерЗаказа,
	            |	ВТЗаказыКОтбору.Заказ,
	            |	новаМестнаяДоставка.ТочкаПрибытия.Адрес.Широта,
	            |	новаМестнаяДоставка.ТочкаПрибытия.Адрес.Долгота
	            |ИЗ
	            |	ВТЗаказыКОтбору КАК ВТЗаказыКОтбору
	            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БизнесПроцесс.новаМестнаяДоставка КАК новаМестнаяДоставка
	            |		ПО ВТЗаказыКОтбору.НомерЗаказа = новаМестнаяДоставка.Номер
	            |ГДЕ
	            |	новаМестнаяДоставка.ТочкаПрибытия.Москва = ЛОЖЬ
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |УНИЧТОЖИТЬ ВТЗаказыПоедут
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |УНИЧТОЖИТЬ ВТЗаказы
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	ВТТаблицаСГруппировкой.ТипЗаказа КАК ТипЗаказа,
	            |	ВТТаблицаСГруппировкой.НомерЗаказа,
	            |	ВТТаблицаСГруппировкой.Заказ,
				//+Широков 30.08.2021 по письму
	            |	ВТТаблицаСГруппировкой.Заказ.Дата КАК ДатаЗаказа,
				//-Широков 30.08.2021 по письму
	            |	ВТТаблицаСГруппировкой.Широта,
	            |	ВТТаблицаСГруппировкой.Долгота
	            |ИЗ
	            |	ВТТаблицаСГруппировкой КАК ВТТаблицаСГруппировкой
	            |
	            |СГРУППИРОВАТЬ ПО
	            |	ВТТаблицаСГруппировкой.ТипЗаказа,
	            |	ВТТаблицаСГруппировкой.НомерЗаказа,
	            |	ВТТаблицаСГруппировкой.Заказ,
	            |	ВТТаблицаСГруппировкой.Широта,
	            |	ВТТаблицаСГруппировкой.Долгота
	            |ИТОГИ ПО
	            |	ТипЗаказа";
				
	//ТекДата = НачалоДня(ТекущаяДата() + 86400);			
	//Если Не ВвестиДату(ТекДата, "Укажите дату запроса..", ЧастиДаты.Дата) Тогда
	//	Возврат Ложь;
	//КонецеСли;	
	
	Зап.УстановитьПараметр("Док", Объект.Ссылка);
	Зап.УстановитьПараметр("ДатаНачала", НачалоДня(ТекДата));
	//Зап.УстановитьПараметр("ДатаНачала2", НачалоДня(ТекущаяДата()));
	Зап.УстановитьПараметр("ДатаНачала2", НачалоДня(ТекДата));

	Зап.УстановитьПараметр("ДатаОкончания", КонецДня(ТекДата));
	
	Рез = Зап.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Мак = ПолучитьМакетНаСервере();
	
	ОблШ = Мак.ПолучитьОбласть("Шапка");
	ОблС = Мак.ПолучитьОбласть("Строка");
	ОблТЗ = Мак.ПолучитьОбласть("ТипЗаказа");
	
	Таб = Новый ТабличныйДокумент;
	Таб.Вывести(ОблШ);
	МасБет = Новый ТаблицаЗначений;
	МасБет.Колонки.Добавить("НомерЗаказа");
	МасБет.Колонки.Добавить("ВнешнийНомерЗаказа");
	//+Широков 30.08.2021 по письму
	МасБет.Колонки.Добавить("ДатаЗаказа");
	//-Широков 30.08.2021 по письму
	
	
	НомераЗаказов = "";
	
	Для Каждого Тек Из Объект.Штрихкоды Цикл
		Если ЗначениеЗаполнено(Тек.Заказ) Тогда
			Если НомераЗаказов = "" Тогда
				НомераЗаказов = СокрЛП(Тек.Заказ.Номер);
			Иначе	
				НомераЗаказов = НомераЗаказов + "," + СокрЛП(Тек.Заказ.Номер);
			КонецеСли;	
		КонецеСли;	
	конецЦикла;	
	
	Ткст = "select o.orderid, o.reasonRrefusal, o.deliveryNote
	|from _order o (nolock )where 
	|o.orderId IN(" + НомераЗаказов + ")";
	
	ПодключениеКМагазину = евген.СоздатьПодключениеКИнтернетМагазину();
	                                                
	RS = Евген.ЗапросКИнтернетМагазину(Ткст, ПодключениеКМагазину);
	ТабАд = Евген.СоздатьТаблицу(RS, "orderid_Ч, reasonRrefusal, deliveryNote");
	
	
	ЕстьДанные = Ложь;
	Пока Рез.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ОблТЗ.Параметры, Рез);
		Дет = Рез.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Таб.Вывести(ОблТЗ);
		Пока Дет.Следующий() Цикл
			
			Если Рез.ТипЗаказа = "За МКАД" Тогда
				Москва = Истина;
				Бет = ОбщегоНазначения.ПринадлежностьКРайонуЗаМКАД(Константы.ГруппаРайоновБетонка.Получить(), Дет.Широта, Дет.Долгота, Москва);
				Если Бет Тогда
					Нов = МасБет.Добавить();
					Нов.НомерЗаказа = Дет.НомерЗаказа;
					Нов.ВнешнийНомерЗаказа = СокрЛП(Дет.Заказ.НомерВнешнегоЗаказа);
					//+Широков 30.08.2021 по письму
					Нов.ДатаЗаказа = Дет.ДатаЗаказа;
					//-Широков 30.08.2021 по письму
					Продолжить;
				КонецЕСли;
			КонецеСли;
			
			
			Если ЗначениеЗаполнено(Дет.НомерЗаказа) Тогда
				ЗаполнитьЗначенияСвойств(ОблС.Параметры, Дет);
				ОблС.Параметры.ВнешнийНомерЗаказа = СокрЛП(Дет.Заказ.НомерВнешнегоЗаказа);
				ОблС.Параметры.НомерЗаказа = СокрЛП(Дет.Заказ.Номер);
				//+Широков 30.08.2021 по письму
				ОблС.Параметры.ДатаЗаказа = Дет.ДатаЗаказа;
				//-Широков 30.08.2021 по письму
				
				Струк = Новый Структура;
				Струк.вставить("orderId_Ч", Число(Дет.Заказ.Номер));
				
				НайАд = ТабАд.НайтиСтроки(Струк);
				Если НайАд.Количество() <> 0 Тогда
					ОблС.Параметры.ПричинаОтказаПереноса = СокрЛП(НайАд[0].reasonRrefusal);
					ОблС.Параметры.КомментарийВодителя = СокрЛП(НайАд[0].deliveryNote);
				КонецеСли;	
				
				Таб.Вывести(ОблС);
				ЕстьДанные = Истина;
			КонецЕсли;	
		КонецЦикла;
	КонецЦикла;	
	
	Если МасБет.Количество() <> 0 Тогда
		ОблТЗ.Параметры.ТипЗаказа = "Бетонка";
		Таб.Вывести(ОблТЗ);
	КонецеСли;	
	
	Для Каждого Тек Из МасБет Цикл
		ЗаполнитьЗначенияСвойств(ОблС.Параметры, Тек);
		Таб.Вывести(ОблС);
	КонецЦикла;	
	
	Если ЕстьДанные Тогда
		//Таб.Показать();
		Возврат Таб;
	Иначе
		//Предупреждение("Данные отсутствуют!");
		//Возврат Ложь;
		Возврат Неопределено;
	КонецеСли;	
	
	//Возврат Истина;
КонецФункции	

&НаСервере
Функция ПолучитьМакетНаСервере()
	ДОбъект = РеквизитФормыВЗначение("Объект");
	Макет = ДОбъект.ПолучитьМакет("СписокЗаказовКПереносу");
	Возврат Макет;
КонецФункции	


&НаКлиенте
Процедура ПечатьСпискаЗаказовКПереносу_(Команда)
	
	ТекДата = НачалоДня(ТекущаяДата() + 86400);			
	Если Не ВвестиДату(ТекДата, "Укажите дату запроса..", ЧастиДаты.Дата) Тогда
		Возврат;
	КонецеСли;	
	
	ТабДок = ПечатьСпискаЗаказовКПереносу(ТекДата);
	Если ТабДок = Неопределено Тогда
		Предупреждение("Данные отсутствуют!");
	Иначе
		ТабДок.Показать();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если ПараметрыЗаписи["РежимЗаписи"] = РежимЗаписиДокумента.Проведение Тогда	
		Оповестить("ОбновитьГрафикЭкипажей");		
	КонецЕсли;
	
КонецПроцедуры
